cases/ansys_verification/VMFL002/case/system/blockMeshDict.template
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
// VMFL002 axisymmetric WEDGE, total included angle t = 5 deg (N-AV9 applies).
// Pipe: L = 0.1 m (x), R = 0.0025 m (radial).  half-angle 2.5 deg:
//   sin(2.5 deg) = 0.0436193873653361 ; cos(2.5 deg) = 0.9990482215818578
scale 1;
vertices
(
    (0     0                     0)
    (0.1   0                     0)
    (0.1   0.00249762055395464  -0.000109048468413340)
    (0     0.00249762055395464  -0.000109048468413340)
    (0     0                     0)
    (0.1   0                     0)
    (0.1   0.00249762055395464   0.000109048468413340)
    (0     0.00249762055395464   0.000109048468413340)
);
blocks ( hex (0 1 2 3 4 5 6 7) (__NX__ __NR__ 1) simpleGrading (1 1 1) );
edges ();
boundary
(
    inlet  { type patch; faces ((0 4 7 3)); }
    outlet { type patch; faces ((1 2 6 5)); }
    wall   { type wall;  faces ((3 7 6 2)); }
    front  { type wedge; faces ((4 5 6 7)); }
    back   { type wedge; faces ((0 3 2 1)); }
);
