cases/ansys_verification/VMFL002/case/0/p
FoamFile { version 2.0; format ascii; class volScalarField; object p; }
// KINEMATIC pressure (m2/s2).  dP[Pa] = rho * dp  with rho = 13529 kg/m3.
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0;
boundaryField
{
    inlet  { type zeroGradient; }
    outlet { type fixedValue; value uniform 0; }
    wall   { type zeroGradient; }
    front  { type wedge; }
    back   { type wedge; }
}
