cases/ansys_verification/VMFL002/case/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }
solvers
{
    p { solver PCG; preconditioner DIC; tolerance 1e-12; relTol 0.01; }
    U { solver PBiCGStab; preconditioner DILU; tolerance 1e-12; relTol 0.1; }
    T { solver PBiCGStab; preconditioner DILU; tolerance 1e-12; relTol 0; }
}
// NO residualControl: every level runs to EXACTLY endTime so that CLAUDE.md rule 4
// ("last time == endTime", "ExecutionTime count == endTime") is literally testable.
// Iterative convergence is graded separately from postProcessing/resid/.../solverInfo.dat
// (rule 5 step 1).  The full endTime is what the frozen cost estimate is based on.
SIMPLE { nNonOrthogonalCorrectors 2; consistent yes; }
relaxationFactors { equations { U 0.9; p 0.9; } }
